[Killed] LessThanNegotiation
:22:13
         private array $openingHours = [];
 
         public function __construct(array $location, int $capacity) {
-            if ($capacity < 0) {
+            if ($capacity >= 0) {
                 throw new InvalidArgumentException('capacity must be >= 0');
             }
killedBy: ExampleTest::testParkingCreation
statusReason: 1) ExampleTest::testParkingCreation
InvalidArgumentException: capacity must be >= 0

C:\Users\marti\Documents\GitHub\Projet-Systme-de-Parking-Partage\src\Domain\Entities\Parking.php:20
C:\Users\marti\Documents\GitHub\Projet-Systme-de-Parking-Partage\src\Tests\ExampleTest.php:14

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Survived] LessThan
:22:13
         private array $openingHours = [];
 
         public function __construct(array $location, int $capacity) {
-            if ($capacity < 0) {
+            if ($capacity <= 0) {
                 throw new InvalidArgumentException('capacity must be >= 0');
             }

[Killed] PublicVisibility
:40:9
             return $this->id;
         }
 
-        public function getLocation() : array {
+        protected function getLocation(): array
             return $this->location;
         }
killedBy: ExampleTest::testParkingCreation
statusReason: 1) ExampleTest::testParkingCreation
Error: Call to protected method Parking::getLocation() from scope ExampleTest

C:\Users\marti\Documents\GitHub\Projet-Systme-de-Parking-Partage\src\Tests\ExampleTest.php:17

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
:44:9
             return $this->location;
         }
 
-        public function getCapacity() : int {
+        protected function getCapacity(): int
             return $this->capacity;
         }
killedBy: ExampleTest::testParkingCreation
statusReason: 1) ExampleTest::testParkingCreation
Error: Call to protected method Parking::getCapacity() from scope ExampleTest

C:\Users\marti\Documents\GitHub\Projet-Systme-de-Parking-Partage\src\Tests\ExampleTest.php:16

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
